# DebugtabDataboundcontrolsdemoDouble Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DebugtabDataboundcontrolsdemoDouble Property
ParameterTypeId Class See Also
---
"Double"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DebugtabDataboundcontrolsdemoDouble { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DebugtabDataboundcontrolsdemoDouble As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DebugtabDataboundcontrolsdemoDouble {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace